
&НаКлиенте
Процедура СканироватьQRCode(Команда)
	#Если МобильноеПриложениеКлиент Тогда
		Если СредстваМультимедиа.ПоддерживаетсяСканированиеШтрихКодов() Тогда
			ОписаниеОповещенияСканирования = Новый ОписаниеОповещения("ОбработкаОтсканированногоQRCode", ЭтаФорма);
			СредстваМультимедиа.ПоказатьСканированиеШтрихКодов("Просканируйте QRCode", ОписаниеОповещенияСканирования, , ТипШтрихКода.Двухмерный);
		Иначе
			nsОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не поддерживается сканирование QRCode!");
		КонецЕсли;
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтсканированногоQRCode(QRCode, Результат, Сообщение, ДополнительныеПараметры) Экспорт
	Если Результат Тогда
		УстановитьКонстантыНаСервере(QRCode);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьКонстантыНаСервере(QRCode)
	ДанныеQR = nsОбщегоНазначения.ПрочитатьДанныеИзJSON(QRCode);
	Если ЗначениеЗаполнено(ДанныеQR) Тогда
		Если ЗначениеЗаполнено(ДанныеQR["PushServiceAdress"]) Тогда
			НаборКонстант.nsАдресPushСервиса = ДанныеQR["PushServiceAdress"];
		КонецЕсли; 
	Иначе
		nsОбщегоНазначенияКлиентСервер.СообщитьПользователю("Данные QRCode не распознаны.");
	КонецЕсли; 
КонецПроцедуры
