#Область ПрограммныйИнтерфейс

Процедура УстановитьИдентификаторПодписчика(ИдентификаторПодписчика) Экспорт
	
	ИдентификаторПодписчикаXML = nsОбщегоНазначения.СериализоватьXDTO(ИдентификаторПодписчика);
	
	МенеджерЗаписи = РегистрыСведений.nsPushПодписчики.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.МобильноеУстройство = Константы.nsID.Получить();
	МенеджерЗаписи.МобильнаяОС = Константы.nsМобильнаяОС.Получить();
	МенеджерЗаписи.Идентификатор = Новый ХранилищеЗначения(ИдентификаторПодписчикаXML, Новый СжатиеДанных(9));
	МенеджерЗаписи.Записать();
	
КонецПроцедуры
 
#КонецОбласти

