
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ОткрытьФорму(ПолучитьИмяФормы(),, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры

&НаСервере
Функция ПолучитьИмяФормы()
	Если Константы.nsМобильнаяОС.Получить() = Перечисления.nsМобильныеОС.Android Тогда
		Возврат "ОбщаяФорма.nsPushFCM";
	Иначе
		Возврат "ОбщаяФорма.nsPushAPNs";
	КонецЕсли; 
КонецФункции
 