&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИдентификаторПодписчикаXML = nsPushСервер.ПолучитьИдентификаторПодписчикаXML(Запись.МобильноеУстройство);
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьPush(Команда)
	Результат = ОтправитьPushНаСервере();
	Если Результат = Неопределено Тогда
		ПоказатьПредупреждение(, "Ошибка отправки сообщения. Не получен идентификатор подписчика.");
	ИначеЕсли ТипЗнч(Результат) = Тип("Число") И НЕ Результат = 200 Тогда 	
		ПоказатьПредупреждение(, "Ошибка отправки сообщения. См.журнал");
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция ОтправитьPushНаСервере()
	Если ЗначениеЗаполнено(ИдентификаторПодписчикаXML) Тогда
		Если Константы.nsМобильнаяОС.Получить() = Перечисления.nsМобильныеОС.Android Тогда
			Возврат nsPushСервер.ОтправитьPUSH_Android(ИдентификаторПодписчикаXML, pTitle, Data, Text);		
		Иначе
			Возврат nsPushСервер.ОтправитьPUSH_iOS(ИдентификаторПодписчикаXML, pTitle, Data, Text);		
		КонецЕсли; 
	Иначе
		Возврат Неопределено;
	КонецЕсли; 
КонецФункции

