
&НаСервере
Процедура ОтправитьPushНаСервере()
	ИдентификаторПодписчикаОбъект = nsPushСервер.ПолучитьИдентификаторПодписчикаОбъект(Запись.МобильноеУстройство);
	Если НЕ ИдентификаторПодписчикаОбъект = Неопределено Тогда
		nsPushСервер.ОтправитьPUSH_Android(ИдентификаторПодписчикаОбъект, Title, Data, Text);		
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьPush(Команда)
	ОтправитьPushНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИдентификаторПодписчикаXML = nsPushСервер.ПолучитьИдентификаторПодписчикаXML(Запись.МобильноеУстройство);
КонецПроцедуры
