Процедура ПриНачалеРаботыСистемы()
	
	// Подсистема Push
	#Если МобильноеПриложениеКлиент Тогда
	Попытка
		nsPushКлиент.ИнициализацияДанныхPush();

		ПодключитьОбработчикОжидания("ОбновитьИдентификаторПодписчикаВФоне", 7200);
		
		nsPushКлиент.ПодключитьОбработчикPush();
	Исключение
		nsОбработкаОшибок.ЗаписатьОшибку(ОписаниеОшибки());
	КонецПопытки; 
	#КонецЕсли
	// Конец Push
	
КонецПроцедуры

Процедура ПередЗавершениемРаботыСистемы(Отказ, ТекстПредупреждения)
	// Подсистема Push
	ОтключитьОбработчикОжидания("ОбновитьИдентификаторПодписчикаВФоне");
	// Конец Push
КонецПроцедуры

Процедура ОбновитьИдентификаторПодписчикаВФоне() Экспорт
	// Подсистема Push
	#Если МобильноеПриложениеКлиент Тогда
		nsPushКлиент.ИнициализацияДанныхPush();
	#КонецЕсли
	// Конец Push
КонецПроцедуры