
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Если Найти(СистемнаяИнформация.ВерсияОС, "iOS") Тогда
		Константы.nsМобильнаяОС.Установить(Перечисления.nsМобильныеОС.iOS);
	ИначеЕсли Найти(СистемнаяИнформация.ВерсияОС, "Android") Тогда
		Константы.nsМобильнаяОС.Установить(Перечисления.nsМобильныеОС.Android);
	ИначеЕсли Найти(СистемнаяИнформация.ВерсияОС, "Windows") ИЛИ Найти(Строка(СистемнаяИнформация.ТипПлатформы), "Windows") Тогда
		Константы.nsМобильнаяОС.Установить(Перечисления.nsМобильныеОС.Windows);
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Константы.nsID.Получить()) Тогда
		Константы.nsID.Установить(Новый УникальныйИдентификатор);	
	КонецЕсли; 
	
КонецПроцедуры
