#Область Сериализация

Функция ЗаписатьДанныеВJSON(Данные) Экспорт
	Попытка
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON());     
		
		НастройкиСериализацииJSON = Новый НастройкиСериализацииJSON;
		НастройкиСериализацииJSON.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.ЛокальнаяДатаСоСмещением;
		НастройкиСериализацииJSON.ФорматСериализацииДаты = ФорматДатыJSON.ISO;

		ЗаписатьJSON(ЗаписьJSON, Данные, НастройкиСериализацииJSON);
		
		Возврат ЗаписьJSON.Закрыть();
	Исключение
	    nsОбработкаОшибок.ЗаписатьОшибку(ИнформацияОбОшибке());
		Возврат Неопределено;
	КонецПопытки; 
КонецФункции

Функция ПрочитатьДанныеИзJSON(СтрокаJSON) Экспорт
	Попытка
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
		Возврат ПрочитатьJSON(ЧтениеJSON, Истина);
	Исключение
		nsОбработкаОшибок.ЗаписатьОшибку(ИнформацияОбОшибке());
		Возврат Неопределено;
	КонецПопытки; 
КонецФункции

Функция СериализоватьXDTO(ИсходныйОбъект) Экспорт
	
	ОбъектЗначениеXDTO = СериализаторXDTO.ЗаписатьXDTO(ИсходныйОбъект);
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	ПараметрыЗаписиXML = Новый ПараметрыЗаписиXML("UTF-8", "1.0", Ложь); 
	ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОбъектЗначениеXDTO);
	
	Возврат ЗаписьXML.Закрыть();
КонецФункции

Функция ДесериализоватьXDTO(СтрокаXML) Экспорт
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(СтрокаXML);
	ИсходныйОбъект = СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
	ЧтениеXML.Закрыть(); 
	
	Возврат ИсходныйОбъект;
КонецФункции

#КонецОбласти

Функция ТекущаяВерсия() Экспорт
	Возврат Строка(Метаданные.Версия);
КонецФункции
