Функция ПолучитьИдентификатор(ID) Экспорт
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	PushПодписчики.Идентификатор
	|ИЗ
	|	РегистрСведений.PushПодписчики КАК PushПодписчики
	|ГДЕ
	|	PushПодписчики.МобильноеУстройство = &ID";
	Запрос.УстановитьПараметр("ID", ID);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Результат = Выборка.Идентификатор.Получить();
	КонецЕсли;  	
	
	Возврат Результат;
КонецФункции
 
Процедура ОчиститьНеКорректныеЗаписи() Экспорт
	ПустойПользователь = Справочники.Пользователи.ПустаяСсылка().УникальныйИдентификатор();
	НаборЗаписей = РегистрыСведений.PushПодписчики.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(ПустойПользователь);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать(Истина);
КонецПроцедуры
